Revit 2015 API
Definitions.Create Method (String, ParameterType)
Creates a new parameter definition using name and type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. Use Create(Autodesk.Revit.DB.ExternalDefinitonCreationOptions) instead")]
public Definition Create(
	string name,
	ParameterType type
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. Use Create(Autodesk.Revit.DB.ExternalDefinitonCreationOptions) instead")> _
Public Function Create ( _
	name As String, _
	type As ParameterType _
) As Definition
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. Use Create(Autodesk.Revit.DB.ExternalDefinitonCreationOptions) instead")]
public:
Definition^ Create(
	String^ name,
	ParameterType type
)
Parameters
name
Type: System.String
The name of the parameter definition to be created.
type
Type: Autodesk.Revit.DB.ParameterType
The name of the parameter type for the new definition.
Return Value
If successful a reference to the new parameter definition is returned, otherwise null.
Remarks
This method only supports creation of new external defintions (shared parameters).
See Also
Definitions Class
Create Overload
Autodesk.Revit.DB Namespace